Tekla.Structures.Model.SurfaceObject
The SurfaceObject class represents a surface object in the model. Currently this class
only support dynamic surfaces whose geometries are determined by the parts or pours
they associate to. It is not allowed to modify the geometry of a dynamic surface on Open API.
The polymesh setter of this class throws .
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
using System.Collections;
using System.Collections.Generic;
public class Example
{
public void Example1()
{
Point startPointBeam = new Point(0.0, 0.0, 0.0);
Point endPointBeam = new Point(10000.0, 0.0, 0.0);
Beam Beam = new Beam(startPointBeam, endPointBeam)
{
Profile = { ProfileString = "400*400" },
Material = { MaterialString = "Concrete_Undefined" }
};
Beam.Insert();
SurfaceObject surfaceObject = new SurfaceObject();
surfaceObject.Polymesh = CreateSingleFacePolymeshGeometry(
new[]
{
new Vector(    0.0, -200.0, 0.0), // 0
new Vector(10000.0, -200.0, 0.0), // 1
new Vector(10000.0,  200.0, 0.0), // 2
new Vector(    0.0,  200.0, 0.0)  // 3
});
surfaceObject.Father = this.TestBeam;
surfaceObject.Insert();
}
private static FacetedBrep CreateSingleFacePolymeshGeometry(Vector[] vertices)
{
var outerWires = new int[1][];
outerWires[0] = new int[vertices.Length];
for (int i = 0; ii < vertices.Length; i++)
outerWires[0][i] = i;
var innerWires = new Dictionary<int, int[][]> { };
return new FacetedBrep(vertices, outerWires, innerWires);
}
}

Tekla.Structures.Model.SurfaceObject.Polymesh
The surface geometry brep.

Tekla.Structures.Model.SurfaceObject.CreateInstanceDelegate(Tekla.Structures.ModelInternal.dotSurfaceObject_t@)
Invokes the delegate of creating this surface in the model.
surface the surface polymesh
Returns:
The error code returned from the delegate.

Tekla.Structures.Model.SurfaceObject.SelectInstanceDelegate(Tekla.Structures.ModelInternal.dotSurfaceObject_t@)
Invokes the delegate of selecting this surface in the model.
Returns:
The error code returned from the delegate.

Tekla.Structures.Model.SurfaceObject.ModifyInstanceDelegate(Tekla.Structures.ModelInternal.dotSurfaceObject_t@)
Invokes the delegate of modifying this surface in the model.
Returns:
The error code returned from the delegate.